Repository: hoojinguyen/vocab-craft-app
Catalog: Packages/CraftUIKit/Sources/CraftUIKit/Resources/Localizable.xcstrings
Source language: en
Languages: vi

# craft.audio.playing
source: Playing pronunciation...
vi: Đang phát âm...

# craft.audio.pronounce
source: Pronounce word
vi: Phát âm từ vựng

# craft.button.loading_a11y
source: Loading
vi: Đang tải

# craft.choice.correct_a11y
source: Correct Answer
vi: Đáp án đúng

# craft.choice.disabled_a11y
source: Disabled
vi: Vô hiệu hóa

# craft.choice.selected_a11y
source: Selected
vi: Đã chọn

# craft.choice.wrong_a11y
source: Incorrect Answer
vi: Đáp án chưa đúng

# craft.common.action.action
source: Action
vi: Tác vụ

# craft.common.action.cancel
source: Cancel
vi: Hủy

# craft.common.action.close
source: Close
vi: Đóng

# craft.common.action.confirm
source: Confirm
vi: Xác nhận

# craft.common.action.continue
source: Continue
vi: Tiếp tục

# craft.common.action.dismiss
source: Dismiss
vi: Đóng

# craft.common.action.retry
source: Retry
vi: Thử lại

# craft.common.state.active
source: Active
vi: Đang hoạt động

# craft.common.state.completed
source: Completed
vi: Đã hoàn thành

# craft.common.state.empty
source: Empty
vi: Trống

# craft.common.state.loading
source: Loading
vi: Đang tải

# craft.common.state.locked
source: Locked
vi: Đang khóa

# craft.common.state.off
source: Off
vi: Tắt

# craft.common.state.on
source: On
vi: Bật

# craft.common.state.upcoming
source: Upcoming
vi: Chưa đến

# craft.common.unit.days_format
source: %lld days
vi: %lld ngày

# craft.common.unit.days_single
source: days
vi: ngày

# craft.common.unit.minutes_format
source: %lld min
vi: %lld phút

# craft.common.unit.percent_word_format
source: %lld percent
vi: %lld phần trăm

# craft.common.unit.words_format
source: %lld new words
vi: %lld từ vựng mới

# craft.countdown.go_text
source: GO!
vi: BẮT ĐẦU!

# craft.countdown.label_format
source: Countdown %lld
vi: Đếm ngược %lld

# craft.countdown.tap_to_skip
source: Tap anywhere to skip
vi: Chạm để bỏ qua

# craft.countdown.tap_to_skip_hint
source: Double tap to start immediately
vi: Nhấn đúp để bắt đầu ngay

# craft.countdown.time_remaining_label
source: Time remaining
vi: Thời gian còn lại

# craft.feedback.continue_action
source: Continue
vi: Tiếp tục

# craft.feedback.error_title
source: Incorrect
vi: Chưa chính xác

# craft.feedback.info_title
source: Explanation
vi: Giải thích

# craft.feedback.success_title
source: Nice work!
vi: Chính xác!

# craft.feedback.warning_title
source: Almost!
vi: Gần đúng!

# craft.flipcard.back_side_hint
source: Back of card
vi: Mặt sau của thẻ

# craft.flipcard.flip_to_back_action
source: Flip to back
vi: Lật ra mặt sau

# craft.flipcard.flip_to_front_action
source: Flip to front
vi: Lật ra mặt trước

# craft.flipcard.front_side_hint
source: Front of card
vi: Mặt trước của thẻ

# craft.learning_path.challenge_lesson
source: CONQUER CHALLENGE
vi: CHINH PHỤC THỬ THÁCH

# craft.learning_path.close_sheet_hint
source: Double tap to close lesson details
vi: Nhấn đúp để đóng thông tin bài học

# craft.learning_path.continue_callout
source: CONTINUE
vi: TIẾP TỤC

# craft.learning_path.continue_lesson_format
source: CONTINUE (%@)
vi: TIẾP TỤC HỌC (%@)

# craft.learning_path.default_objective_1
source: Master standard pronunciation and core vocabulary meanings
vi: Nắm vững phát âm chuẩn và ý nghĩa từ vựng trọng tâm

# craft.learning_path.default_objective_2
source: Practice sentence reflex via interactive Spaced Repetition drills
vi: Thực hành phản xạ câu qua bài tập tương tác Spaced Repetition

# craft.learning_path.default_objective_3_format
source: Earn %@ and maintain daily study streak
vi: Tích lũy %@ và duy trì chuỗi Streak học tập

# craft.learning_path.default_unit_label
source: UNIT
vi: BÀI HỌC

# craft.learning_path.duration_format_a11y
source: Duration: %@
vi: Thời lượng: %@

# craft.learning_path.empty_desc
source: There are no lesson sections available in this learning path.
vi: Hiện chưa có bài học nào trong lộ trình này.

# craft.learning_path.empty_title
source: No Lessons Available
vi: Chưa có bài học nào

# craft.learning_path.locked_lesson
source: LESSON LOCKED
vi: BÀI HỌC ĐANG KHÓA

# craft.learning_path.node_bonus_a11y
source: Bonus Lesson: %@
vi: Bài học thử thách: %@

# craft.learning_path.node_completed_a11y
source: Lesson: %@, Completed
vi: Bài học: %@, Đã hoàn thành

# craft.learning_path.node_current_a11y
source: Lesson: %@, Current lesson
vi: Bài học: %@, Bài học hiện tại

# craft.learning_path.node_current_format_a11y
source: Lesson: %1$@, Current lesson. %2$@ complete
vi: Bài học: %1$@, Bài học hiện tại. Đã hoàn thành %2$@

# craft.learning_path.node_in_progress_a11y
source: Lesson: %@, In progress
vi: Bài học: %@, Đang học dở

# craft.learning_path.node_in_progress_format_a11y
source: Lesson: %1$@, In progress. %2$@ complete
vi: Bài học: %1$@, Đang học dở. Đã hoàn thành %2$@

# craft.learning_path.node_locked_a11y
source: Lesson: %@, Locked
vi: Bài học: %@, Đang khóa

# craft.learning_path.node_upcoming_a11y
source: Lesson: %@, Upcoming lesson
vi: Bài học: %@, Bài học sắp tới

# craft.learning_path.objectives_header
source: Lesson Objectives
vi: Mục tiêu bài học

# craft.learning_path.review_lesson_format
source: REVIEW (+%lld XP)
vi: ÔN TẬP LẠI (+%lld XP)

# craft.learning_path.reward_format_a11y
source: Reward: %lld XP
vi: Phần thưởng: %lld XP

# craft.learning_path.start_lesson
source: START LESSON
vi: BẮT ĐẦU HỌC

# craft.learning_path.tap_to_continue_hint
source: Double tap to continue
vi: Nhấn đúp để tiếp tục học

# craft.learning_path.tap_to_review_hint
source: Double tap to review
vi: Nhấn đúp để ôn tập

# craft.learning_path.tap_to_scroll_unit_hint
source: Double tap to scroll to the top of this unit
vi: Chạm hai lần để cuộn về đầu bài học này

# craft.learning_path.tap_to_start_hint
source: Double tap to start
vi: Nhấn đúp để bắt đầu học

# craft.learning_path.unlock_requirement_hint
source: Complete previous lessons to unlock
vi: Hoàn thành bài học trước để mở khóa

# craft.progress.label
source: Progress
vi: Tiến độ

# craft.search.clear_a11y
source: Clear search
vi: Xóa tìm kiếm

# craft.search.placeholder
source: Search...
vi: Tìm kiếm...

# craft.search.trailing_action_a11y
source: Trailing action
vi: Tác vụ mở rộng

# craft.segmented_bar.label_a11y
source: Segmented metric bar
vi: Thanh tỉ lệ phân đoạn

# craft.segmented_bar.segment_fallback
source: Segment
vi: Phân đoạn

# craft.sparkle.celebration_label
source: Celebration!
vi: Chúc mừng!

# craft.sparkle.sparkle_label
source: Sparkle!
vi: Lấp lánh!

# craft.speech.analyzing
source: Analyzing pronunciation...
vi: Đang phân tích phát âm...

# craft.speech.listening
source: Listening...
vi: Đang lắng nghe...

# craft.speech.mic_start_a11y
source: Start speaking
vi: Bắt đầu nói

# craft.speech.mic_stop_a11y
source: Stop recording
vi: Dừng ghi âm

# craft.speech.score_format
source: Score: %@
vi: Điểm: %@

# craft.speech.tap_to_speak
source: Tap to speak
vi: Chạm để nói

# craft.speech.try_again
source: Try speaking again
vi: Thử nói lại

# craft.step_node.step_format
source: Step %lld: %@
vi: Bước %lld: %@

# craft.step_node.tap_hint
source: Double tap to select this step
vi: Chạm hai lần để chọn bước này

# craft.step_progress.a11y_value_format
source: Step %lld of %lld
vi: Bước %lld trên %lld

# craft.stepper.decrease_a11y
source: Decrease
vi: Giảm

# craft.stepper.default_label
source: Stepper
vi: Bộ đếm

# craft.stepper.increase_a11y
source: Increase
vi: Tăng

# craft.streak.badge_a11y_format
source: %lld-day study streak, %@ tier. %@
vi: Chuỗi %lld ngày học liên tiếp, Cấp độ %@. %@

# craft.streak.badge_a11y_hint
source: Double tap to view streak details.
vi: Chạm hai lần để xem chi tiết chuỗi ngày.

# craft.streak.best_record_format
source: Best: %lld days
vi: Kỷ lục: %lld ngày

# craft.streak.card_a11y_overview
source: Displays weekly streak overview and activity status.
vi: Hiển thị tổng quan chuỗi ngày học trong tuần.

# craft.streak.celebration_hint
source: Double tap to dismiss and continue learning.
vi: Chạm hai lần để đóng màn hình và tiếp tục học.

# craft.streak.celebration_title
source: Streak Extended!
vi: Chuỗi ngày rực lửa!

# craft.streak.continue_action
source: Continue Learning
vi: Tiếp tục học

# craft.streak.day_inspect_hint
source: Double tap to inspect day details.
vi: Chạm hai lần để kiểm tra chi tiết ngày.

# craft.streak.day_status_completed
source: Completed
vi: Đã hoàn thành

# craft.streak.day_status_missed
source: Missed
vi: Bỏ lỡ

# craft.streak.day_status_pending
source: Pending
vi: Đang chờ hoàn thành

# craft.streak.day_status_saved
source: Freeze shield used
vi: Đã dùng khiên bảo vệ

# craft.streak.day_status_upcoming
source: Upcoming
vi: Chưa đến

# craft.streak.freeze_shield_format
source: %lld/%lld Shields
vi: %lld/%lld Khiên

# craft.streak.milestone_title_format
source: %lld-Day Milestone!
vi: Cột mốc %lld ngày!

# craft.streak.msg_blaze
source: Great streak! Your learning flame is burning bright.
vi: Phong độ tuyệt vời! Ngọn lửa học tập của bạn đang rực sáng.

# craft.streak.msg_blaze_milestone
source: Awesome! You've achieved a blaze streak, keep up the momentum!
vi: Đẳng cấp! Bạn đã đạt chuỗi rực lửa, tiếp tục duy trì đà tiến bộ này!

# craft.streak.msg_legendary
source: Unstoppable! You are an inspiring example of consistency.
vi: Không thể ngăn cản! Bạn là tấm gương học tập đầy cảm hứng.

# craft.streak.msg_legendary_milestone
source: Legendary! You've reached a pinnacle milestone with extraordinary dedication!
vi: Huyền thoại! Bạn đã chinh phục cột mốc đỉnh cao với sự kiên trì phi thường!

# craft.streak.msg_starter
source: Great progress! You are building a solid learning habit.
vi: Tuyệt vời! Bạn đang xây dựng một thói quen học tập vững chắc.

# craft.streak.msg_starter_1
source: Great start! Keep up the daily habit of learning.
vi: Khởi đầu tuyệt vời! Hãy duy trì thói quen học mỗi ngày nhé.

# craft.streak.tier_blaze
source: Blaze Streak
vi: Chuỗi rực lửa

# craft.streak.tier_legendary
source: Legendary Streak
vi: Chuỗi huyền thoại

# craft.streak.tier_starter
source: Starter Streak
vi: Chuỗi khởi đầu

# craft.streak.today_completed
source: Completed for today
vi: Hôm nay đã hoàn thành

# craft.streak.today_pending
source: Pending completion for today
vi: Hôm nay chưa hoàn thành

# craft.streak.view_milestone_action
source: View milestone rewards
vi: Xem mốc thưởng

# craft.streak.view_shield_action
source: View freeze shields
vi: Xem khiên bảo vệ

# craft.tab_bar.badge_count_format
source: %lld new items
vi: %lld mục mới

# craft.tab_bar.center_action_fallback
source: Action
vi: Tác vụ

# craft.textfield.hide_password_a11y
source: Hide password
vi: Ẩn mật khẩu

# craft.textfield.show_password_a11y
source: Show password
vi: Hiện mật khẩu

# craft.waveform.audio_level_format
source: %lld percent average audio level
vi: Mức âm thanh trung bình %lld phần trăm

# craft.waveform.recording_active_a11y
source: Audio waveform recording active
vi: Đang thu âm sóng âm thanh

# craft.waveform.visualizer_a11y
source: Audio waveform visualizer
vi: Trình hiển thị sóng âm
